# Day 1

In [4]:
# Load packages
import pandas as pd
import numpy as np

In [2]:
# Load and inspect data
data = pd.read_csv('../data/input_01.txt', header=None)
data.columns = ['data']

data

      data
0      157
1      148
2      149
3      146
4      144
...    ...
1995  8007
1996  8010
1997  8016
1998  8020
1999  8026

[2000 rows x 1 columns]

## Part 1

In [14]:
# Add depth change (delta)
data['delta'] = data['data'] - data['data'].shift(1)
data

      data  delta
0      157    NaN
1      148   -9.0
2      149    1.0
3      146   -3.0
4      144   -2.0
...    ...    ...
1995  8007    1.0
1996  8010    3.0
1997  8016    6.0
1998  8020    4.0
1999  8026    6.0

[2000 rows x 2 columns]

In [13]:
# Find number of times depth increased
print(f'Depth increased {len(data[data.delta>0])} times')

Depth increased 1548 times

## Part 2

In [18]:
data['rolling_3'] = data['data'].rolling(3, min_periods=1).mean()
data['delta_rolling_3'] = data['rolling_3'] - data['rolling_3'].shift(1)
data

      data  delta    rolling_3  delta_rolling_3
0      157    NaN   157.000000              NaN
1      148   -9.0   152.500000        -4.500000
2      149    1.0   151.333333        -1.166667
3      146   -3.0   147.666667        -3.666667
4      144   -2.0   146.333333        -1.333333
...    ...    ...          ...              ...
1995  8007    1.0  8002.000000         6.000000
1996  8010    3.0  8007.666667         5.666667
1997  8016    6.0  8011.000000         3.333333
1998  8020    4.0  8015.333333         4.333333
1999  8026    6.0  8020.666667         5.333333

[2000 rows x 4 columns]

In [19]:
# Find number of times depth increased
print(f'Depth increased {len(data[data.delta_rolling_3>0])} times')

Depth increased 1589 times